---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.ZoneEquipment
source: html/47766c2e-d7c7-a896-d0f2-8ba97d4cacb5.htm
---
# ZoneEquipment Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.